import React from 'react';

import styles from './Terms.module.scss';

export const Terms = () => {
  return (
    <div className={styles.terms}>
      <div className={styles.container}>
        <div className={styles.content}>
          <div className={styles.title}>
            <h1>Правила обработки персональных данных ООО КОМПАНИЯ «VEENOU»</h1>
          </div>
          <div className={styles.text}>
            <div className={styles.textBlock}>
              <ol className={`${styles.ol} ${styles.olMajor}`}>
                <li>
                  <b>Общие положения.</b> <br></br> <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Настоящая Политика конфиденциальности действует в
                      отношении всей информации, которую ООО КОМПАНИЯ «VEENOU»
                      (далее - Компания) и/или его аффилированные лица, в том
                      числе входящие в одну группу с ООО КОМПАНИЯ «VEENOU »
                      могут получить о Пользователе во время использования им
                      любого из сайтов, сервисов, служб, программ, продуктов или
                      услуг Компании, и/или в ходе исполнения Компанией любых
                      соглашений и договоров с Пользователем, включая
                      возможность рассылки информации, в том числе и рекламного
                      характера (далее – Использование).
                    </li>
                    <li>
                      Использование Сервисов Компании означает безоговорочное
                      согласие Пользователя с настоящими Правилами обработки
                      персональных данных (далее – Правила) и указанными в ней
                      условиями обработки его персональной информации; в случае
                      несогласия с этими условиями Пользователь должен
                      воздержаться от Использования.
                    </li>
                    <li>
                      Компания исходит из того, что Пользователь, инициирующий
                      Использование, сознательно определяет свои запросы и
                      контролирует технические параметры используемого им
                      оборудования, а также ознакомился с настоящими Правилами в
                      полном объеме. В случае несогласия Пользователя с
                      Правилами Использование должно быть прекращено.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>Персональная информация Пользователя.</b> <br></br>{' '}
                  <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      В рамках настоящих Правил под «персональной информацией
                      Пользователя» понимаются:
                      <br></br> <br></br>
                      <ol>
                        <li>
                          Персональная информация, которую Пользователь
                          предоставляет о себе самостоятельно при регистрации
                          (создании учётной записи) или в процессе участия в
                          Использовании. Обязательная для предоставления
                          Использования информация помечена специальным образом.
                          Иная информация предоставляется Пользователем на его
                          усмотрение.
                        </li>
                        <li>
                          Данные, которые автоматически передаются в результате
                          Использования Пользователем с помощью установленного
                          на устройстве Пользователя программного обеспечения, в
                          том числе IP-адрес, данные файлов cookie, информация о
                          браузере Пользователя (или иной программе, с помощью
                          которой осуществляется доступ к Использованию),
                          технические характеристики оборудования и программного
                          обеспечения, используемых Пользователем, дата и время
                          доступа, адреса запрашиваемых страниц и иная подобная
                          информация.
                        </li>
                        <li>
                          Иная информация о Пользователе, возможность получения
                          которой обусловлена технически.
                        </li>
                      </ol>
                    </li>
                    <li>
                      Компания не контролирует и не несет ответственность за
                      обработку информации сайтами третьих лиц, на которые
                      Пользователь может перейти по ссылкам, доступным на сайтах
                      Компании, в том числе в результатах поиска.
                    </li>
                    <li>
                      Компания не проверяет достоверность персональной
                      информации, предоставляемой Пользователем, и не имеет
                      возможности оценивать его дееспособность. Однако Компания
                      и Пользователь исходят из того, что Пользователь
                      предоставляет достоверную и достаточную персональную
                      информацию и поддерживает эту информацию в актуальном
                      состоянии.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>Цели обработки персональной информации Пользователя.</b>{' '}
                  <br></br> <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Компания собирает и хранит только ту часть персональной
                      информации Пользователя, которая необходима Компании для
                      предоставления/получения Использования, за исключением
                      случаев, когда законодательством предусмотрено
                      обязательное хранение персональной информации в течение
                      определенного законом срока. <br></br> <br></br>
                      Необходимо персональной информацией признается: <br></br>{' '}
                      <br></br>- Фамилия, Имя, Отчество Пользователя; <br></br>-
                      Контактные данные Пользователя (номер мобильного телефона
                      и/или адрес e-mail).
                    </li>
                    <li>
                      Персональную информацию Пользователя Компания обрабатывает
                      в следующих целях: <br></br>
                      <br></br>
                      <ol>
                        <li>
                          Идентификация стороны в рамках Использования,
                          соглашений и договоров с Компанией;
                        </li>
                        <li>
                          Предоставление Пользователю возможности
                          персонализированного Использования и исполнение
                          соглашений и договоров;
                        </li>
                        <li>
                          Связь с Пользователем, в том числе направление
                          уведомлений, запросов и информации, касающихся
                          Использования, исполнения соглашений и договоров, а
                          также обработка запросов и заявок от Пользователя,
                          включая возможные рассылки информационного и
                          рекламного характера;
                        </li>
                        <li>
                          Улучшение качества Использования, удобства, разработка
                          новых возможностей и опций Использования;
                        </li>
                        <li>
                          Информирования о товарах, услугах и акциях Компании;
                        </li>
                        <li>Участия в программах лояльности Компании;</li>
                        <li>Таргетирование рекламных материалов;</li>
                        <li>
                          Проведение статистических и иных исследований на
                          основе обезличенных данных.
                        </li>
                      </ol>
                    </li>
                    <li>
                      Компания имеет право обрабатывать информацию о
                      пользователях Интернета, полученную в результате обмена
                      информацией с третьими лицами по протоколам OpenID и
                      OAuth, при условии что последние получат предварительное
                      согласие пользователей Интернета на указанную обработку.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>
                    Условия обработки персональной информации Пользователя и её
                    передачи третьим лицам.
                  </b>
                  <br></br> <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      В отношении персональной информации Пользователя
                      сохраняется ее конфиденциальность, кроме случаев
                      добровольного предоставления Пользователем информации о
                      себе для общего доступа неограниченному кругу лиц. При
                      использовании отдельных опций Использования, Пользователь
                      соглашается с тем, что определённая часть его персональной
                      информации становится общедоступной.
                    </li>
                    <li>
                      Компания вправе передать персональную информацию
                      Пользователя третьим лицам в следующих случаях: <br></br>
                      <br></br>
                      <ol>
                        <li>
                          Пользователь выразил согласие на такие действия;
                        </li>
                        <li>
                          Передача необходима для использования Пользователем
                          определенного вида опций Использования либо для
                          исполнения определенного соглашения или договора с
                          Пользователем;
                        </li>
                        <li>
                          Передача предусмотрена российским или иным применимым
                          законодательством в рамках установленной
                          законодательством процедуры;
                        </li>
                        <li>
                          Такая передача происходит в рамках продажи или иной
                          передачи бизнеса (полностью или в части), при этом к
                          приобретателю переходят все обязательства по
                          соблюдению условий настоящей Политики применительно к
                          полученной им персональной информации;
                        </li>
                        <li>
                          В результате обработки персональной информации
                          Пользователя путем ее обезличивания могут быть
                          получены обезличенные статистические данные, которые
                          передаются третьему лицу для проведения исследований,
                          выполнения работ или оказания услуг по поручению
                          Компании.
                        </li>
                      </ol>
                    </li>
                    <li>
                      При обработке персональных данных Пользователей Компания
                      руководствуется Федеральным законом РФ «О персональных
                      данных».
                    </li>
                    <li>
                      Компания вправе поручить обработку персональных данных
                      третьим лицам на основании заключаемого с этими лицами
                      договора, в соответствии с целями указанных в п.3.2. Лица,
                      осуществляющие обработку персональных данных по поручению
                      Компании, обязуются соблюдать принципы и правила обработки
                      и защиты персональных данных, предусмотренные Федеральным
                      законом № 152-ФЗ «О персональных данных». Для каждого лица
                      определены перечень действий (операций) с персональными
                      данными, которые будут совершаться юридическим лицом,
                      осуществляющим обработку персональных данных, цели
                      обработки, установлена обязанность такого лица соблюдать
                      конфиденциальность и обеспечивать безопасность
                      персональных данных при их обработке, а также указаны
                      требования к защите обрабатываемых персональных данных.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>
                    Изменение и удаление персональной информации. Обязательное
                    хранение данных.
                  </b>{' '}
                  <br></br>
                  <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Пользователь может в любой момент изменить (обновить,
                      дополнить) предоставленную им персональную информацию или
                      её часть.
                    </li>
                    <li>
                      Пользователь также в любой момент может потребовать
                      удалить предоставленную им в рамках определенной учетной
                      записи персональную информацию.
                    </li>
                    <li>
                      Права, предусмотренные пп. 5.1. и 5.2. настоящей Политики
                      могут быть ограничены в соответствии с требованиями
                      законодательства. В частности, такие ограничения могут
                      предусматривать обязанность Компании сохранить измененную
                      или удаленную Пользователем информацию на срок,
                      установленный законодательством, и передать такую
                      информацию в соответствии с законодательно установленной
                      процедурой уполномоченному государственному органу.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>
                    Обработка персональной информации при помощи файлов Cookie и
                    счетчиков.
                  </b>{' '}
                  <br></br>
                  <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Файлы cookie, имеющиеся на оборудовании Пользователя по
                      любой причине, могут использоваться Компанией для
                      предоставления Пользователю персонализированных опций
                      использования, для таргетирования/рассылки
                      информации/рекламы, которая показывается Пользователю, в
                      статистических и исследовательских целях, а также для
                      улучшения опций Использования.
                    </li>
                    <li>
                      Пользователь осознает, что оборудование и программное
                      обеспечение, применяемое для Использования могут обладать
                      функцией запрещения операций с файлами cookie (для любых
                      сайтов или для определенных сайтов), а также удаления
                      ранее полученных файлов cookie.
                    </li>
                    <li>
                      Компания вправе установить, что предоставление
                      определенных опций Использования возможно лишь при
                      условии, что прием и получение файлов cookie разрешены
                      Пользователем.
                    </li>
                    <li>
                      Структура файла cookie, его содержание и технические
                      параметры определяются на усмотрение Компании и могут
                      изменяться без предварительного уведомления Пользователя.
                    </li>
                    <li>
                      Счетчики, размещенные Компанией при Использовании, могут
                      использоваться для анализа файлов cookie Пользователя, для
                      сбора и обработки статистической информации и других
                      целей. Технические параметры работы счетчиков определяются
                      Компанией и могут изменяться без предварительного
                      уведомления Пользователя.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>
                    Меры, применяемые для защиты персональной информации
                    Пользователя.
                  </b>{' '}
                  <br></br> <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Компания принимает необходимые и достаточные
                      организационные и технические меры для защиты персональной
                      информации Пользователя от неправомерного или случайного
                      доступа, уничтожения, изменения, блокирования,
                      копирования, распространения, а также от иных
                      неправомерных действий с ней третьих лиц.
                    </li>
                    <li>
                      Компания использует для авторизации доступа к
                      Использованию информацию из профиля Пользователя (логин и
                      пароль, контрольные секретный вопрос и ответ). При этом
                      Компания вправе предоставлять такие данные лицам,
                      указанным в ст.4 настоящего документа. Ответственность за
                      сохранность данной информации, включая логин и пароль,
                      несет Пользователь. Любые действия, совершенные с ее
                      использованием, считаются Компанией совершенными
                      Пользователем. Передача собственного логина и пароля
                      пользователем третьим лицам запрещена. <br></br>
                      <br></br>В случае, если Пользователю стали известны логин
                      и пароль другого пользователя, а также иная
                      конфиденциальная информация о последнем, он обязан
                      уведомить об этом Компанию и не использовать ставшую
                      известной ему указанную информацию.
                    </li>
                    <li>
                      Доступ Пользователя к Использованию может вызывать
                      обращение на Интернет-ресурсы третьих лиц и загрузку с них
                      программного кода и/или графических объектов (в том числе,
                      невидимых при отображении Интернет-страниц браузером),
                      используемых в рекламных целях и в целях сбора статистики.
                      Владельцы названных ресурсов имеют техническую возможность
                      осуществлять сбор информации о Пользователе и
                      самостоятельно определяют условия ее использования.
                      <br></br>Путем настройки программного обеспечения
                      Пользователь имеет возможность заблокировать запросы на
                      графические изображения, размещенные на серверах третьих
                      лиц, однако это может привести к потере читаемости и
                      появлению ошибок при отображении ресурсов. <br></br>При
                      переходе пользователей со страниц Использования Компании
                      на страницы Интернет-ресурсов третьих лиц Пользователь
                      самостоятельно определяет пределы использования информации
                      о них в рамках условий и правил, определяемых владельцами
                      соответствующих Интернет-ресурсов.
                    </li>
                    <li>
                      Компании могут содержать ссылки на ресурсы третьих лиц, на
                      которых настоящий документ не распространяется. VEENOU не
                      несет ответственности за действия третьих лиц,
                      использующих Интернет-ресурсы Компании в своей
                      деятельности. VEENOU не несет ответственности за
                      организацию использования протоколов OpenID и OAuth
                      третьими лицами и надлежащее обеспечение последними защиты
                      информации о пользователях.
                      <br></br>В случае совместных партнерских проектов и
                      сервисов Компании в официальных документах последнего
                      и/или документах партнеров, определяющих использование
                      соответствующих Интернет-ресурсов, должно быть указано,
                      как осуществляется обработка информации о пользователях
                      всеми партнерами, включая информацию о том, кто хранит и
                      обрабатывает персональные данные пользователей. Компания
                      не несет ответственности за несоблюдение указанными лицами
                      требований действующего законодательства Российской
                      Федерации.
                    </li>
                    <li>
                      Обеспечение безопасности персональных данных Пользователя
                      достигается путем мониторинга на определение угроз
                      безопасности персональных данных при их обработке;
                      применению организационных и технических мер по
                      обеспечению безопасности персональных данных при их
                      обработки; путем оценки эффективности принимаемых мер по
                      обеспечению безопасности персональных данных; путем
                      обнаружения фактов несанкционированного доступа к
                      Персональным данным и принятием мер по их устранению;
                      путем установления правил доступа к персональным данным;
                      путем контроля за принимаемыми мерами по обеспечению
                      безопасности персональных данных.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>
                    Изменение Политики конфиденциальности. Применимое
                    законодательство.
                  </b>{' '}
                  <br></br> <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Компания имеет право вносить изменения в настоящую
                      Политику конфиденциальности с учетом требований
                      действующего в Российской Федерации в области защиты
                      персональных данных.
                    </li>
                    <li>
                      К настоящей Политике и отношениям между Пользователем и
                      Компанией, возникающим в связи с применением Политики
                      конфиденциальности, подлежит применению право Российской
                      Федерации.
                    </li>
                  </ol>
                </li>
                <li>
                  <b>Обратная связь. Права и обязанности Сторон.</b> <br></br>{' '}
                  <br></br>
                  <ol className={`${styles.ol} ${styles.olMinor}`}>
                    <li>
                      Все предложения или вопросы по поводу настоящей Политики
                      Пользователь вправе направлять в Службу поддержки Компании
                      по адресу: Владивосток, улица Пушкина, д. 1234, стр. 11,
                      ООО КОМПАНИЯ «VEENOU» (ИНН 9999999999 ОГРН 9999999999999)
                      или по телефону +7 (000) 000-00-00 и электронному адресу
                      <a href="mailto:samuilryvkin@gmail.com">
                        samuilryvkin@gmail.com
                      </a>
                    </li>
                    <li>
                      Пользователь Сайта имеет права, определяемые положениями
                      действующего законодательства РФ.
                    </li>
                    <li>
                      При посещении интернет-ресурсов Компании и Использовании
                      Пользователь обязан: соблюдать положения действующего
                      законодательства Российской Федерации и настоящего
                      документа; возмещать убытки, понесенные Компанией, другими
                      Пользователями или третьими лицами в результате нарушения
                      Политики или законодательства Российской Федерации;
                      соблюдать положения документов, регулирующих
                      Использование, а также законодательство Российской
                      Федерации; ознакомиться со всей информацией юридического
                      характера, размещенной на Сайте или доступной на нем
                      посредством ссылок.
                    </li>
                    <li>
                      Пользователю при Использовании запрещается: публиковать и
                      распространять любую информацию, которая: <br></br>
                      <br></br>
                      <ul>
                        <li>
                          содержит угрозы, дискредитирует, оскорбляет, порочит
                          честь и достоинство или деловую репутацию, или
                          нарушает неприкосновенность частной жизни других
                          Пользователей Сайта или третьих лиц;
                        </li>
                        <li>нарушает права несовершеннолетних лиц;</li>
                        <li>
                          является непристойной, содержит нецензурную лексику,
                          содержит порнографические изображения и тексты или
                          сцены сексуального характера с участием
                          несовершеннолетних;
                        </li>
                        <li>
                          содержит сцены насилия либо бесчеловечного обращения с
                          животными;
                        </li>
                        <li>
                          содержит описание средств и способов суицида, любое
                          подстрекательство к его совершению;
                        </li>
                        <li>
                          пропагандирует и/или способствует разжиганию расовой,
                          религиозной, этнической ненависти или вражды,
                          пропагандирует фашизм или идеологию расового
                          превосходства;
                        </li>
                        <li>содержит экстремистские материалы;</li>
                        <li>
                          пропагандирует преступную деятельность или содержит
                          советы, инструкции или руководства по совершению
                          преступных действий;
                        </li>
                        <li>
                          содержит информацию ограниченного доступа, включая, но
                          не ограничиваясь, государственной и коммерческой
                          тайной, информацией о частной жизни третьих лиц;
                        </li>
                        <li>
                          содержит рекламу или описывает привлекательность
                          употребления наркотических веществ, информацию о
                          распространении наркотиков, рецепты их изготовления и
                          советы по употреблению;
                        </li>
                        <li>носит мошеннический характер;</li>
                        <li>
                          нарушает права третьих лиц на результаты
                          интеллектуальной деятельности;
                        </li>
                        <li>нарушает права субъектов персональных данных;</li>
                        <li>
                          нарушает иные права и интересы граждан и юридических
                          лиц или требования законодательства Российской
                          Федерации.
                        </li>
                      </ul>
                    </li>
                    <li>
                      Пользователю запрещается: <br></br>
                      <br></br>
                      <ul>
                        <li>осуществлять массовые рассылки сообщений;</li>
                        <li>
                          использовать программное обеспечение и осуществлять
                          действия, направленные на нарушение нормального
                          функционирования технических возможностей и
                          оборудования Компании;
                        </li>
                        <li>
                          публиковать и распространять на Сайте или иным образом
                          использовать вирусы, трояны и другие вредоносные
                          программы;
                        </li>
                        <li>
                          размещать на Сайте коммерческую и политическую
                          рекламу;
                        </li>
                        <li>
                          осуществлять иные действия, которые могут нанести вред
                          Компании, третьим лицам, Пользователям.
                        </li>
                      </ul>
                    </li>
                  </ol>
                </li>
              </ol>
            </div>
          </div>
        </div>
        <div className={styles.spacer}></div>
      </div>
    </div>
  );
};
